import pandas as pd

def geometry_table(array):
    data_1 = {
        'Кольцевые площади на входе в сопловую решетку 𝑖−ой ступени':'F_1_inl_i','Кольцевые площади на выходе из сопловой решетки 𝑖−ой ступени':'F_1_out_i',
        'Кольцевые площади на входе в рабочую решетку 𝑖−ой ступени':'F_2_inl_i','Кольцевые площади на выходе из рабочей решетки 𝑖−ой ступени':'F_2_out_i',  
        'Корневой диаметр на входе в сопловую решетку 𝑖−ой ступени':'Dk_sopl_inl_i','Корневой диаметр на выходе из сопловой решетки 𝑖−ой ступени':'Dk_sopl_out_i',
        'Корневой диаметр на входе в рабочую решетку 𝑖−ой ступени':'Dk_rab_inl_i','Корневой диаметр на выходе из рабочей решетки 𝑖−ой ступени':'Dk_rab_out_i',
        'Средний диаметр на входе в сопловую решетку 𝑖−ой ступени':'Dsr_sopl_inl_i', 'Средний диаметр на выходе из сопловой решетки 𝑖−ой ступени':'Dsr_sopl_out_i',
        'Средний диаметр на входе в рабочую решетку 𝑖−ой ступени':'Dsr_rab_inl_i', 'Средний диаметр на выходе из рабочей решетки 𝑖−ой ступени':'Dsr_rab_out_i',
        'Переферийный диаметр на входе в сопловую решетку 𝑖−ой ступени':'Dp_sopl_inl_i', 'Переферийный диаметр на выходе из сопловой решетки 𝑖−ой ступени':'Dp_sopl_out_i',
        'Переферийный диаметр на входе в рабочую решетку 𝑖−ой ступени':'Dp_rab_inl_i','Переферийный диаметр на выходе из рабочей решетки 𝑖−ой ступени':'Dp_rab_out_i',
        'Высота сопловой лопатки на входе 𝑖−ой ступени':'h_sopl_inl_i', 'Высота сопловой лопатки на выходе 𝑖−ой ступени':'h_sopl_out_i',
        'Высота рабочей лопатки на входе 𝑖−ой ступени':'h_rab_inl_i', 'Высота рабочей лопатки на выходе 𝑖−ой ступени':'h_rab_out_i',
        'Ширина венца для СА':'S_sopl_i','Ширина венца для РК':'S_rab_i',
        'Осевой зазор':'delta_s_i'}
    df_1 = pd.DataFrame(list(data_1.items()),columns=['Параметры','Обозначение']) 
    df_2_ = pd.DataFrame(['м2', 'м2', 'м2', 'м2', 'м', 'м', 'м', 'м', 'м', 'м', 'м', 'м', 'м', 'м', 'м', 'м', 'м', 'м', 'м', 'м','м', 'м', 'м'], columns = ['Разм'])
    df_2 = pd.DataFrame((array))
    df12_merged = df_1.join(df_2_, rsuffix='_right')
    df_merged = df12_merged.join(df_2, rsuffix='_right')
    pd.set_option("display.precision", 3)
    return df_merged