import pandas as pd

def sectionTable(array):
    data_1 = {'Радиус сечения СР':'radius_sopl_i',
            'Безразмерный радиус сечения СР': 'r_sopl_i_',
            'Относительный радиус сечения СР': 'rela_sopl_i', 

            'Радиус сечения РР':'radius_sopl_i',
            'Безразмерный радиус сечения РР': 'r_sopl_i_',
            'Относительный радиус сечения РР': 'rela_sopl_i',

            'Температура на входе в ступень (параметры полного торможения)':'t_0_i_',
            'Температура на выходе из СР (теоретическая)':'t_1t_i',
            'Температура на выходе из СР (действительная)':'t_1_i',
            'Температура на выходе из СР (параметры полного торможения)':'t_1w_i',
            'Температура на выходе из РР (теоретическая)':'t_2t_i_',
            'Температура на выходе из РР (статические параметры)':'t_2t_i',
            'Температура на выходе из РР (действительная)':'t_2_i',
            'Температура на выходе из РР (параметры полного торможения)':'t_2w_i',

            'Давление на входе в ступень (параметры полного торможения)':'P_0_i_',
            'Давление на выходе из СР (теоретическая)':'P_1t_i',
            'Давление на выходе из СР (действительная)':'P_1_i',
            'Давление на выходе из СР (параметры полного торможения)':'P_1w_i',
            'Давление на выходе из РР (теоретическая)':'P_2t_i_',
            'Давление на выходе из РР (статические параметры)':'P_2t_i',
            'Давление на выходе из РР (действительная)':'P_2_i',
            'Давление на выходе из РР (параметры полного торможения)':'P_2w_i',
                
            'Энтальпия на входе в ступень (параметры полного торможения)':'h_0_i_',
            'Энтальпия на выходе из СР (теоретическая)':'h_1t_i',
            'Энтальпия на выходе из СР (действительная)':'h_1_i',
            'Энтальпия на выходе из СР (параметры полного торможения)':'h_1w_i',
            'Энтальпия на выходе из РР (теоретическая)':'h_2t_i_',
            'Энтальпия на выходе из РР (статические параметры)':'h_2t_i',
            'Энтальпия на выходе из РР (действительная)':'h_2_i',
            'Энтальпия на выходе из РР (параметры полного торможения)':'h_2w_i',
                
            'Объем на входе в ступень (параметры полного торможения)':'V_0_i_',
            'Объем на выходе из СР (теоретическая)':'V_1t_i',
            'Объем на выходе из СР (действительная)':'V_1_i',
            'Объем на выходе из СР (параметры полного торможения)':'V_1w_i',
            'Объем на выходе из РР (теоретическая)':'V_2t_i_',
            'Объем на выходе из РР (статические параметры)':'V_2t_i',
            'Объем на выходе из РР (действительная)':'V_2_i',
            'Объем на выходе из РР (параметры полного торможения)':'V_2w_i',
                
            'Степень сухости на входе в ступень (параметры полного торможения)':'x_0_i_',
            'Степень сухости на выходе из СР (теоретическая)':'x_1t_i',
            'Степень сухости на выходе из СР (действительная)':'x_1_i',
            'Степень сухости на выходе из СР (параметры полного торможения)':'x_1w_i',
            'Степень сухости на выходе из РР (теоретическая)':'x_2t_i_',
            'Степень сухости на выходе из РР (статические параметры)':'x_2t_i',
            'Степень сухости на выходе из РР (действительная)':'x_2_i',
            'Степень сухости на выходе из РР (параметры полного торможения)':'x_2w_i',

            'Изоэнтропийный теплоперепад СР':'H_0_sa_i_',
            'Изоэнтропийный теплоперепад РР':'H_0_rk_i',
            'Термическая степень реактивности': 'ro_term_i',
            'Кинематическая степень реактивности': 'ro_k_i',  
            'Абсолютная скорость на выходе из СР':'C_1_i',
            'Абсолютная скорость на выходе из РР':'C_2_i',
            'Относительная скорость на выходе из СР':'W_1_i',
            'Относительная скорость на выходе из РР':'W_2_i',
            'Окружная скорость на выходе из СР':'U_1_i',
            'Окружная скорость на выходе из РР':'U_2_i',    
            'Угол абсолютной скорости на выходе из СР':'alpha_1_i',
            'Угол абсолютной скорости на выходе из РР':'alpha_2_i',
            'Угол относительной скорости на выходе из СР':'betta_1_i',
            'Угол относительной скорости на выходе из РР':'betta_2_i',   
            'Коэффициент потери скорости в СР':'fi_i',
            'Коэффициент потери скорости в РР':'psi_i',  
            
            'Мах по асболютной скорости из СР':'M_1c_i',
            'Мах по относительной скорости из СР':'M_1w_i', 
            'Мах по асболютной скорости из РР':'M_2c_i',
            'Мах по относительной скорости из РР':'M_2w_i'}
                

    df_1 = pd.DataFrame(list(data_1.items()),columns=['Параметры','Обозначение']) 
    df_2_ = pd.DataFrame(['м', '-', '-', 'м', '-', '-', '℃', '℃', '℃', '℃', '℃', '℃', '℃', '℃', 
                        'МПа', 'МПа', 'МПа', 'МПа', 'МПа', 'МПа', 'МПа', 'МПа',
                        'кДж/кг', 'кДж/кг', 'кДж/кг', 'кДж/кг', 'кДж/кг', 'кДж/кг', 'кДж/кг', 'кДж/кг',
                        'м3/кг', 'м3/кг', 'м3/кг', 'м3/кг', 'м3/кг', 'м3/кг', 'м3/кг', 'м3/кг',
                        '-', '-', '-', '-', '-', '-', '-', '-', 'кДж/кг', 'кДж/кг', '-', '-',
                        'м/c', 'м/c', 'м/c', 'м/c', 'м/c', 'м/c', 'град', 'град', 'град', 'град',
                        '-', '-', '-', '-', '-', '-'], columns = ['Разм'])
    df_2 = pd.DataFrame((array))
    df12_merged = df_1.join(df_2_, rsuffix='_right')
    df_merged = df12_merged.join(df_2, rsuffix='_right')
    pd.set_option("display.precision", 3)
    return df_merged